#include <rypch.h>
#include "EditorLayer.h"

#include <Rynex/Core/Application.h>
#include <Rynex/Core/Input.h>
#include <Rynex/Project/Project.h>
#include <Rynex/Asset/Base/AssetManager.h>
// #include <Rynex/Asset/EditorAssetManegerThreade.h>
#include <Rynex/Utils/PlatformUtils.h>
#include <Rynex/Math/Math.h>

#include <Rynex/Serializers/SceneSerializer.h>
#include <Rynex/Serializers/TextureSerialiazer.h>
#include <Rynex/Serializers/VertexArraySerialzer.h>
#if RY_SCRIPTING_HAZEL
   #include <Rynex/Scripting/HazelScripting/ScriptEngine.h> 
#else
    #include <Rynex/Scripting/ScriptingEngine.h>
#endif
#include <Rynex/Renderer/Rendering/Renderer.h>
#include <Rynex/Renderer/Rendering/Renderer2D.h>
#include <Rynex/Renderer/Rendering/Renderer3D.h>
#include <Rynex/Renderer/Materials/BasicMaterial.h>


#include <Rynex/Asset/Import/ShaderImporter.h>
#include <Rynex/Renderer/Objects/Model.h>

#include <imgui/imgui.h>
#include <ImGuizmo.h>

#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>

#include <Rynex/Renderer/Text/Font.h>



namespace Rynex {

#define RY_EDITOR_TEST_ENITITY 0
#define RY_ENABLE_VIEWPORT 1
#define TEST_SHADER_OUTPUT 0


#if TEST_SHADER_OUTPUT

    namespace ShaderSim {
         
        using namespace glm;

        struct InPut_FS
        {
            vec3 Position;	// 12
            vec3 Normal;	// 24
            vec2 Coords;	// 32
        };

        struct DrirectionLigthData_FS
        {
            vec4 Color;
            vec3 Position;
            float Intensitie;
        };

        struct PointLigthData_FS
        {
            vec3 Color;
            float Distence;
            vec3 Position;
            float Intensitie;
        };

        struct SpotLigthData_FS
        {
            vec3 Color;
            float Intensitie;
            vec3 Position;
            float Distence;
            vec3 Direction;
            float Inner;
            float Outer;
        };


        struct CameraData_FS
        {
            mat4 ViewProjectionMatrix;	// 16
            mat4 ViewMatrix;			// 32
            mat4 ProjectionMatrix;		// 48
            vec3 CamerPosition;			// 60
            int Empty;					// 64
        };

        struct ModelData_FS
        {
            vec3 Color;
            float Alpha;
            float Emission;
            float Matalness;
            float Roughness;
            float Shinines;
            float Specular;

            int EntityID;
            ivec2 Empty;
            mat4 ModelMatrix;
        };

        struct AmbientLigth_FS
        {
            vec3 Color;
            float Intensitie;
        };

        struct DrirectionLigth_FS
        {
            int Aktive;
            ivec3 Empty;
            DrirectionLigthData_FS Direction[8];
        };

        struct PointLigth_FS
        {
            int Aktive;
            ivec3 Empty;
            PointLigthData_FS Point[32];
        };

        struct SpotLigth_FS
        {
            int Aktive;
            ivec3 Empty;
            SpotLigthData_FS Spot[32];
        };

        static CameraData_FS Camera = {
            {
